In this notebook, we practice with data warehousing. We do have small warehouse with the same star schema as the lecture notes for `salesdb_sales`, `salesdb_item`, `salesdb_customer`, and `salesdb_store`.

**Submission Instruction**

1- Make a copy and replace blank with your name

2- Complete and run all cells

3- Download .ipynb and submit on Gradescope

In [33]:
%pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\couga\documents\classes-local\ista-322-fa24\classwork\venv\lib\site-packages (9.4.0)
Note: you may need to restart the kernel to use updated packages.

In [34]:
import mysql.connector
import pandas as pd

In [35]:
mysql_address  = '131.193.32.85'
mysql_username='de_student'
mysql_password='DE_Student_PaSS'

mysql_database = 'my_dataengineering_dbs'


def get_conn_cur():
    cnx = mysql.connector.connect(user=mysql_username, password=mysql_password,
          host=mysql_address,
          database=mysql_database, port='3306');
    return (cnx, cnx.cursor())

def run_query(query_string):

  conn, cur = get_conn_cur() # get connection and cursor
  cur.execute(query_string) # executing string as before
  my_data = cur.fetchall() # fetch query data as before
  result_df = pd.DataFrame(my_data, columns=cur.column_names)


  cur.close() # close
  conn.close() # close

  return result_df


def sql_head(table_name):
  conn, cur = get_conn_cur() #get connection and cursor

  #get head information
  table_rows_query = """ SELECT * FROM %s LIMIT 5; """ % table_name
  cur.execute(table_rows_query)
  my_data = cur.fetchall() # fetch results

  # Create a dataframe that combines sql table with column names and return
  df = pd.DataFrame(my_data, columns=cur.column_names)

  cur.close()
  conn.close()
  return df

In [36]:
sql_head("salesdb_customer")

  custID  cName gender  age
0  cust1    Amy      F   20
1  cust2    Bob      M   21
2  cust3  Craig      M   25
3  cust4  Doris      F   22

In [37]:
sql_head('salesdb_store')

  storeID           city       county state
0  store1      Palo Alto  Santa Clara    CA
1  store2  Mountain View  Santa Clara    CA
2  store3     Menlo Park    San Mateo    CA
3  store4        Belmont    San Mateo    CA
4  store5        Seattle         King    WA

In [38]:
sql_head('salesdb_item')

  itemID category color
0  item1   Tshirt  blue
1  item2   Jacket  blue
2  item3   Tshirt   red
3  item4   Jacket  blue
4  item5   Jacket   red

In [39]:
sql_head("salesdb_sales")

  storeID itemID custID price
0  store1  item1  cust1    10
1  store1  item1  cust2    15
2  store1  item1  cust3    20
3  store1  item1  cust3    25
4  store1  item2  cust1    30

Now we look at couple of example queries.

 All inexpensive (price < 25) Tshirts sold in California to young people (age < 22)

In [40]:
sql = """
SELECT S.city, I.color, C.cName, F.price
    FROM salesdb_sales F, salesdb_store S, salesdb_item I, salesdb_customer C
    WHERE F.storeID = S.storeID AND F.itemID = I.itemID
    AND F.custID = C.custID AND S.state = 'CA'
    AND I.category = 'Tshirt' AND C.age < 22 AND F.price < 25; """
run_query(sql)

        city color cName price
0  Palo Alto  blue   Amy    10
1  Palo Alto  blue   Bob    15
2    Belmont   red   Bob    20
3    Belmont   red   Bob    15
4    Belmont   red   Bob    10

Total sales by store ID and customer name

In [41]:
sql= """
SELECT storeID, cName, sum(price)
FROM salesdb_sales S, salesdb_customer C
WHERE S.custID=C.custID
GROUP BY storeID, cName; """
run_query(sql)

   storeID  cName  sum(price)
0   store1    Amy       145.0
1   store1    Bob        95.0
2   store1  Craig        85.0
3   store2    Amy       280.0
4   store2    Bob       215.0
5   store2  Craig       145.0
6   store2  Doris       165.0
7   store3    Bob       330.0
8   store3  Craig       295.0
9   store4    Amy        65.0
10  store4    Bob        70.0
11  store4  Craig        90.0
12  store5    Amy       180.0
13  store5    Bob       225.0
14  store5  Doris       170.0
15  store6  Craig       270.0
16  store6  Doris       525.0

"Drill-down" Total sales by store ID, category, and customer

In [42]:
sql = """
SELECT storeID, I.category, cName, sum(price)
FROM salesdb_sales S, salesdb_customer C, salesdb_item I
WHERE S.custID=C.custID AND S.itemID=I.itemID
GROUP BY storeID, I.category, cName; """
run_query(sql)

   storeID category  cName  sum(price)
0   store1   Jacket    Amy        30.0
1   store1   Jacket    Bob        80.0
2   store1   Jacket  Craig        40.0
3   store1   Tshirt    Amy       115.0
4   store1   Tshirt    Bob        15.0
5   store1   Tshirt  Craig        45.0
6   store2   Jacket    Amy       280.0
7   store2   Jacket    Bob        90.0
8   store2   Jacket  Craig       145.0
9   store2   Jacket  Doris       165.0
10  store2   Tshirt    Bob       125.0
11  store3   Jacket    Bob       165.0
12  store3   Jacket  Craig       145.0
13  store3   Tshirt    Bob       165.0
14  store3   Tshirt  Craig       150.0
15  store4   Jacket  Craig        90.0
16  store4   Tshirt    Amy        65.0
17  store4   Tshirt    Bob        70.0
18  store5   Jacket    Amy       180.0
19  store5   Jacket    Bob       225.0
20  store5   Jacket  Doris       170.0
21  store6   Jacket  Craig       270.0
22  store6   Jacket  Doris       360.0
23  store6   Tshirt  Doris       165.0

"Slice" Total sales by store ID, category, and customer for "store6" only

In [43]:
sql = """
SELECT S.storeID, I.category, cName, sum(price)
FROM salesdb_sales S, salesdb_customer C, salesdb_item I, salesdb_store T
WHERE S.custID=C.custID AND S.itemID=I.itemID
AND S.storeID=T.storeID AND T.storeId ='store6'
GROUP BY storeID, I.category, cName; """
run_query(sql)

  storeID category  cName  sum(price)
0  store6   Jacket  Craig       270.0
1  store6   Jacket  Doris       360.0
2  store6   Tshirt  Doris       165.0

"Dice" Total sales by store ID, category, and customer for "store6" and "Jacket" only

In [44]:
sql = """
SELECT S.storeID, I.category, cName, sum(price)
FROM salesdb_sales S, salesdb_customer C, salesdb_item I, salesdb_store T
WHERE S.custID=C.custID AND S.itemID=I.itemID
AND S.storeID=T.storeID AND T.storeId ='store6' AND I.category='Jacket'
GROUP BY storeID, I.category, cName;"""

run_query(sql)

  storeID category  cName  sum(price)
0  store6   Jacket  Craig       270.0
1  store6   Jacket  Doris       360.0

"Roll-up" Total sales by category

In [45]:
sql = """
SELECT I.category, sum(price)
FROM salesdb_sales S, salesdb_item I
WHERE S.itemID=I.itemID
GROUP BY I.category;"""
run_query(sql)

  category  sum(price)
0   Jacket      2435.0
1   Tshirt       915.0

Total sales by state, county, city

In [46]:
sql = """
SELECT state, county, city, sum(price)
FROM salesdb_sales F, salesdb_store S
WHERE F.storeID = S.storeID
GROUP BY state, county, city; """
run_query(sql)

  state       county           city  sum(price)
0    CA    San Mateo        Belmont       225.0
1    CA    San Mateo     Menlo Park       625.0
2    CA  Santa Clara  Mountain View       805.0
3    CA  Santa Clara      Palo Alto       325.0
4    WA         King        Redmond       795.0
5    WA         King        Seattle       575.0

Total sales by state, county, city WITH ROLLUP. The ROLLUP generates multiple grouping sets based on the columns or expressions specified in the GROUP BY clause, here state, county, and city.

In [47]:
sql = """
SELECT state, county, city, sum(price)
FROM salesdb_sales F, salesdb_store S
WHERE F.storeID = S.storeID
GROUP BY state, county, city WITH ROLLUP; """
run_query(sql)

   state       county           city  sum(price)
0     CA    San Mateo        Belmont       225.0
1     CA    San Mateo     Menlo Park       625.0
2     CA    San Mateo           None       850.0
3     CA  Santa Clara  Mountain View       805.0
4     CA  Santa Clara      Palo Alto       325.0
5     CA  Santa Clara           None      1130.0
6     CA         None           None      1980.0
7     WA         King        Redmond       795.0
8     WA         King        Seattle       575.0
9     WA         King           None      1370.0
10    WA         None           None      1370.0
11  None         None           None      3350.0

Question 1: Write the query to list total sales by state of store and age of customer - [3 points]

In [48]:
sql = """
SELECT state, age, count(*)
FROM salesdb_sales F, salesdb_store S, salesdb_customer C
WHERE F.storeID = S.storeID AND F.custID = C.custID
GROUP BY state, age;
"""
run_query(sql)

  state  age  count(*)
0    CA   20         9
1    CA   21        15
2    CA   22         2
3    CA   25        14
4    WA   20         3
5    WA   21         3
6    WA   22        11
7    WA   25         3

Question 2: Drill down to items by item color (on the basis of the previous query) - [3 points]

In [49]:
sql = """
SELECT state, age, color, count(*) 
FROM salesdb_sales F, salesdb_store S, salesdb_customer C, salesdb_item I
WHERE F.storeID=S.storeID AND F.custID=C.custID AND F.itemID=I.itemID
GROUP BY state, age, color;
"""
run_query(sql)

   state  age color  count(*)
0     CA   20  blue         5
1     CA   20   red         4
2     CA   21  blue         7
3     CA   21   red         8
4     CA   22  blue         2
5     CA   25  blue        11
6     CA   25   red         3
7     WA   20  blue         3
8     WA   21  blue         1
9     WA   21   red         2
10    WA   22  blue         7
11    WA   22   red         4
12    WA   25  blue         1
13    WA   25   red         2

Question 3: Use "with rollup" with the previous query - [3 points]

In [50]:
sql = """
SELECT state, age, color, count(*) 
FROM salesdb_sales F, salesdb_store S, salesdb_customer C, salesdb_item I
WHERE F.storeID=S.storeID AND F.custID=C.custID AND F.itemID=I.itemID
GROUP BY state, age, color WITH ROLLUP;
"""
run_query(sql)

   state   age color  count(*)
0     CA  20.0  blue         5
1     CA  20.0   red         4
2     CA  20.0  None         9
3     CA  21.0  blue         7
4     CA  21.0   red         8
5     CA  21.0  None        15
6     CA  22.0  blue         2
7     CA  22.0  None         2
8     CA  25.0  blue        11
9     CA  25.0   red         3
10    CA  25.0  None        14
11    CA   NaN  None        40
12    WA  20.0  blue         3
13    WA  20.0  None         3
14    WA  21.0  blue         1
15    WA  21.0   red         2
16    WA  21.0  None         3
17    WA  22.0  blue         7
18    WA  22.0   red         4
19    WA  22.0  None        11
20    WA  25.0  blue         1
21    WA  25.0   red         2
22    WA  25.0  None         3
23    WA   NaN  None        20
24  None   NaN  None        60

Question 4: Slice by listing only items with blue color (on the basis of query of Question 2) - [3 points]

In [51]:
sql = """
SELECT state, age, color, count(*) 
FROM salesdb_sales F, salesdb_store S, salesdb_customer C, salesdb_item I
WHERE F.storeID=S.storeID AND F.custID=C.custID AND F.itemID=I.itemID AND I.color="blue"
GROUP BY state, age, color;
"""
run_query(sql)

  state  age color  count(*)
0    CA   20  blue         5
1    CA   21  blue         7
2    CA   22  blue         2
3    CA   25  blue        11
4    WA   20  blue         3
5    WA   21  blue         1
6    WA   22  blue         7
7    WA   25  blue         1

Question 5: Rollup total sales by customer age and item color (on the basis of query of Question 2)  -- the remaining dimensions are customer age and item color. [3 points]

In [52]:
sql = """
SELECT age, color, count(*) 
FROM salesdb_sales F, salesdb_customer C, salesdb_item I
WHERE F.custID=C.custID AND F.itemID=I.itemID
GROUP BY age, color WITH ROLLUP;
"""
run_query(sql)

     age color  count(*)
0   20.0  blue         8
1   20.0   red         4
2   20.0  None        12
3   21.0  blue         8
4   21.0   red        10
5   21.0  None        18
6   22.0  blue         9
7   22.0   red         4
8   22.0  None        13
9   25.0  blue        12
10  25.0   red         5
11  25.0  None        17
12   NaN  None        60